[NoCoverage] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:227:26
-       if (isoDate == null) {
-         return;
-       }
+       if (isoDate == null) {}

[NoCoverage] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:232:66
-       if (cell == null || !cell.isCurrentMonth || cell.isDisabled) {
-         return;
-       }
+       if (cell == null || !cell.isCurrentMonth || cell.isDisabled) {}

[NoCoverage] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:502:23
-       if (cell == null) {
-         return;
-       }
+       if (cell == null) {}

[NoCoverage] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:507:21
-       if (el == null) {
-         return;
-       }
+       if (el == null) {}

[NoCoverage] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:515:23
-       if (index === -1) {
-         return;
-       }
+       if (index === -1) {}

[NoCoverage] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:528:21
-       if (el == null) {
-         return;
-       }
+       if (el == null) {}

[NoCoverage] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:536:23
-       if (index === -1) {
-         return;
-       }
+       if (index === -1) {}

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:50:37
-     private _pendingYearWindowFocus = false;
+     private _pendingYearWindowFocus = true;
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 124 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:56:49
-     @State() private pickerAnnouncement: string = '';
+     @State() private pickerAnnouncement: string = "Stryker was here!";
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 124 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:101:25
-       const focusedCell = isoDate != null ? oldGrid.weeks.flat().find(cell => cell.isoDate === isoDate) : undefined;
+       const focusedCell = true ? oldGrid.weeks.flat().find(cell => cell.isoDate === isoDate) : undefined;
Tests ran:
    bds-calendar-grid quick-picker day-grid cell guards leaves the day grid with no tabbable cell when every in-month cell is disabled
    bds-calendar-grid keyboard moves the roving-tabindex stop to the selected date when the displayed month changes
    bds-calendar-grid keyboard anchors to the first enabled cell, not a disabled today, after a re-render when today falls outside min/max
  and 6 more tests!

[Survived] CallExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:103:5
-       this._cellRefs.clear();
+       ;
Tests ran:
    bds-calendar-grid quick-picker day-grid cell guards leaves the day grid with no tabbable cell when every in-month cell is disabled
    bds-calendar-grid keyboard moves the roving-tabindex stop to the selected date when the displayed month changes
    bds-calendar-grid keyboard anchors to the first enabled cell, not a disabled today, after a re-render when today falls outside min/max
  and 6 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:108:9
-       if (this.view !== CALENDAR_GRID_VIEW.YEARS) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:108:49
-       if (this.view !== CALENDAR_GRID_VIEW.YEARS) {
-         return;
-       }
+       if (this.view !== CALENDAR_GRID_VIEW.YEARS) {}
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] CallExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:113:5
-       this._pickerCellRefs.clear();
+       ;
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker nested header steps the year picker window by a decade from its own header
    bds-calendar-grid quick-picker keyboard activation edges selects the focused year cell with Enter, returning to the month view for that year
  and 6 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:115:42
-       this._pendingYearWindowFocusTarget = focusedYear != null ? focusedYear + (newYear - oldYear) : null;
+       this._pendingYearWindowFocusTarget = true ? focusedYear + (newYear - oldYear) : null;
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker nested header steps the year picker window by a decade from its own header
    bds-calendar-grid quick-picker keyboard activation edges selects the focused year cell with Enter, returning to the month view for that year
  and 6 more tests!

[Survived] CallExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:120:5
-       this._pickerCellRefs.clear();
+       ;
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:122:36
-       this._pendingYearWindowFocus = false;
+       this._pendingYearWindowFocus = true;
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:163:7
-         targetDay != null
+         true
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 57 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:164:34
-           ? flatCells.find(cell => cell.isCurrentMonth && !cell.isDisabled && cell.date.getDate() === targetDay)
+           ? flatCells.find(cell => true && cell.date.getDate() === targetDay)
Tests ran:
    bds-calendar-grid keyboard keeps focus on the same day of month after the displayed month changes

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:164:34
-           ? flatCells.find(cell => cell.isCurrentMonth && !cell.isDisabled && cell.date.getDate() === targetDay)
+           ? flatCells.find(cell => cell.isCurrentMonth || !cell.isDisabled && cell.date.getDate() === targetDay)
Tests ran:
    bds-calendar-grid keyboard keeps focus on the same day of month after the displayed month changes

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:168:9
-       if (targetDay != null) {
+       if (true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 57 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:175:32
-         this._pendingViewFocus = false;
+         this._pendingViewFocus = true;
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:179:9
-       if (this._pendingYearWindowFocus) {
+       if (true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 57 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:180:38
-         this._pendingYearWindowFocus = false;
+         this._pendingYearWindowFocus = true;
Tests ran:
    bds-calendar-grid quick-picker nested header steps the year picker window by a decade from its own header
    bds-calendar-grid quick-picker paging pages the year picker window by a decade with PageUp and PageDown
    bds-calendar-grid quick-picker year-window focus keeps real focus on the equivalent year cell after a year-window shift
  and 4 more tests!

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:187:32
-     disconnectedCallback(): void {
-       this._keyboard.detach();
-     }
+     disconnectedCallback(): void {}
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges detaches its keyboard wiring when removed from the document

[Survived] CallExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:188:5
-       this._keyboard.detach();
+       ;
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges detaches its keyboard wiring when removed from the document

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:207:9
-       if (isoDate == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges ignores day-view activation when no day cell is focused
    bds-calendar-grid keyboard activates the focused cell with Enter and Space, emitting bdsDayClick

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:207:26
-       if (isoDate == null) {
-         return;
-       }
+       if (isoDate == null) {}
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges ignores day-view activation when no day cell is focused

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:212:9
-       if (cell != null) {
+       if (true) {
Tests ran:
    bds-calendar-grid keyboard activates the focused cell with Enter and Space, emitting bdsDayClick

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:227:9
-       if (isoDate == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid events emits bdsDayFocus with the focused cell's ISO date
    bds-calendar-grid events does not emit bdsGridFocusLeave when focus moves between two day cells

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:232:9
-       if (cell == null || !cell.isCurrentMonth || cell.isDisabled) {
+       if (false) {
Tests ran:
    bds-calendar-grid events emits bdsDayFocus with the focused cell's ISO date
    bds-calendar-grid events does not emit bdsGridFocusLeave when focus moves between two day cells

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:232:9
-       if (cell == null || !cell.isCurrentMonth || cell.isDisabled) {
+       if ((cell == null || !cell.isCurrentMonth) && cell.isDisabled) {
Tests ran:
    bds-calendar-grid events emits bdsDayFocus with the focused cell's ISO date
    bds-calendar-grid events does not emit bdsGridFocusLeave when focus moves between two day cells

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:232:9
-       if (cell == null || !cell.isCurrentMonth || cell.isDisabled) {
+       if (false || cell.isDisabled) {
Tests ran:
    bds-calendar-grid events emits bdsDayFocus with the focused cell's ISO date
    bds-calendar-grid events does not emit bdsGridFocusLeave when focus moves between two day cells

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:232:9
-       if (cell == null || !cell.isCurrentMonth || cell.isDisabled) {
+       if (cell == null && !cell.isCurrentMonth || cell.isDisabled) {
Tests ran:
    bds-calendar-grid events emits bdsDayFocus with the focused cell's ISO date
    bds-calendar-grid events does not emit bdsGridFocusLeave when focus moves between two day cells

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:232:9
-       if (cell == null || !cell.isCurrentMonth || cell.isDisabled) {
+       if (false || !cell.isCurrentMonth || cell.isDisabled) {
Tests ran:
    bds-calendar-grid events emits bdsDayFocus with the focused cell's ISO date
    bds-calendar-grid events does not emit bdsGridFocusLeave when focus moves between two day cells

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:248:9
-       if (this.view === CALENDAR_GRID_VIEW.DAYS) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker overlay restores the day grid and outer header to their interactive state on returning to the day view
    bds-calendar-grid quick-picker keyboard and aria returns to the day view on Escape without emitting a navigation event
    bds-calendar-grid quick-picker keyboard and aria announces each view transition once through the local live region
  and 1 more test!

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:248:48
-       if (this.view === CALENDAR_GRID_VIEW.DAYS) {
-         return;
-       }
+       if (this.view === CALENDAR_GRID_VIEW.DAYS) {}
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges does not leave the day view or emit navigation on Escape from the day view

[Survived] CallExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:252:5
-       event.stopPropagation();
+       ;
Tests ran:
    bds-calendar-grid quick-picker overlay restores the day grid and outer header to their interactive state on returning to the day view
    bds-calendar-grid quick-picker keyboard and aria returns to the day view on Escape without emitting a navigation event
    bds-calendar-grid quick-picker keyboard and aria announces each view transition once through the local live region

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:259:9
-       if (table instanceof Node && relatedTarget instanceof Node && table.contains(relatedTarget)) {
+       if (true && table.contains(relatedTarget)) {
Tests ran:
    bds-calendar-grid events does not emit bdsGridFocusLeave when focus moves between two day cells
    bds-calendar-grid events emits bdsGridFocusLeave when focus moves to an element outside the day grid table
    bds-calendar-grid events emits bdsGridFocusLeave when focus leaves the day grid table with no related target

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:259:9
-       if (table instanceof Node && relatedTarget instanceof Node && table.contains(relatedTarget)) {
+       if (table instanceof Node || relatedTarget instanceof Node && table.contains(relatedTarget)) {
Tests ran:
    bds-calendar-grid events does not emit bdsGridFocusLeave when focus moves between two day cells
    bds-calendar-grid events emits bdsGridFocusLeave when focus moves to an element outside the day grid table
    bds-calendar-grid events emits bdsGridFocusLeave when focus leaves the day grid table with no related target

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:279:9
-       if (focusedEntry == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Space, emitting bdsMonthNavigate
    bds-calendar-grid quick-picker keyboard activation edges ignores activation in the month view when no picker cell holds focus

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:279:31
-       if (focusedEntry == null) {
-         return;
-       }
+       if (focusedEntry == null) {}
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges ignores activation in the month view when no picker cell holds focus

[Survived] ObjectLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:283:64
-       const { cells } = generateMonthPickerGrid(this.pickerYear, {
-         locale: this.locale,
-         min: this.min,
-         max: this.max,
-         now: this.now,
-       });
+       const { cells } = generateMonthPickerGrid(this.pickerYear, {});
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Space, emitting bdsMonthNavigate

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:290:9
-       if (cell != null) {
+       if (true) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Space, emitting bdsMonthNavigate

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:370:9
-       if (focusedEntry == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges selects the focused year cell with Enter, returning to the month view for that year
    bds-calendar-grid quick-picker keyboard activation edges ignores activation in the year view when no picker cell holds focus

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:370:31
-       if (focusedEntry == null) {
-         return;
-       }
+       if (focusedEntry == null) {}
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges ignores activation in the year view when no picker cell holds focus

[Survived] ObjectLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:374:68
-       const { cells } = generateYearPickerGrid(this.pickerStartYear, { min: this.min, max: this.max, now: this.now });
+       const { cells } = generateYearPickerGrid(this.pickerStartYear, {});
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges selects the focused year cell with Enter, returning to the month view for that year

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:376:9
-       if (cell != null) {
+       if (true) {
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges selects the focused year cell with Enter, returning to the month view for that year

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:392:31
-       this.pickerAnnouncement = 'Month view';
+       this.pickerAnnouncement = "";
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker keyboard activation edges selects the focused year cell with Enter, returning to the month view for that year

[Survived] ArithmeticOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:405:40
-       if (this.isYearWindowFullyDisabled(this.pickerStartYear - 10)) {
+       if (this.isYearWindowFullyDisabled(this.pickerStartYear + 10)) {
Tests ran:
    bds-calendar-grid quick-picker nested header steps the year picker window by a decade from its own header
    bds-calendar-grid quick-picker paging pages the year picker window by a decade with PageUp and PageDown
    bds-calendar-grid quick-picker paging no-ops paging the year picker window when the target window is entirely outside min/max

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:453:9
-       if (focused == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker nested header steps the year picker window by a decade from its own header
    bds-calendar-grid quick-picker keyboard activation edges selects the focused year cell with Enter, returning to the month view for that year
  and 6 more tests!

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:453:26
-       if (focused == null) {
-         return undefined;
-       }
+       if (focused == null) {}
Tests ran:
    bds-calendar-grid quick-picker year-window focus falls back to a priority year cell when the window shifts with no picker cell focused

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:467:9
-       if (!(target instanceof HTMLElement)) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker keyboard activation edges ignores day-view activation when no day cell is focused
    bds-calendar-grid quick-picker day-grid cell guards leaves the day grid with no tabbable cell when every in-month cell is disabled
    bds-calendar-grid keyboard moves the roving-tabindex stop to the selected date when the displayed month changes
  and 10 more tests!

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:467:43
-       if (!(target instanceof HTMLElement)) {
-         return undefined;
-       }
+       if (!(target instanceof HTMLElement)) {}
Tests ran:
    bds-calendar-grid quick-picker day-grid cell guards leaves the day grid with no tabbable cell when every in-month cell is disabled
    bds-calendar-grid keyboard moves the roving-tabindex stop to the selected date when the displayed month changes
    bds-calendar-grid keyboard anchors to the first enabled cell, not a disabled today, after a re-render when today falls outside min/max
  and 5 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:481:9
-       if (this.view === CALENDAR_GRID_VIEW.DAYS) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:481:48
-       if (this.view === CALENDAR_GRID_VIEW.DAYS) {
-         this.focusCell(this.getPriorityFocusCell());
-         return;
-       }
+       if (this.view === CALENDAR_GRID_VIEW.DAYS) {}
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker overlay restores the day grid and outer header to their interactive state on returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
  and 6 more tests!

[Survived] CallExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:482:7
-         this.focusCell(this.getPriorityFocusCell());
+         ;
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker overlay restores the day grid and outer header to their interactive state on returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
  and 6 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:486:9
-       if (this.view === CALENDAR_GRID_VIEW.MONTHS) {
+       if (true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ObjectLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:487:66
-         const { cells } = generateMonthPickerGrid(this.pickerYear, {
-           locale: this.locale,
-           min: this.min,
-           max: this.max,
-           now: this.now,
-         });
+         const { cells } = generateMonthPickerGrid(this.pickerYear, {});
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!
