[Survived] ObjectLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:497:68
-       const { cells } = generateYearPickerGrid(this.pickerStartYear, { min: this.min, max: this.max, now: this.now });
+       const { cells } = generateYearPickerGrid(this.pickerStartYear, {});
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] OptionalChaining
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:498:31
-       this.focusPickerCellByKey(this.getPriorityYearCell(cells)?.year);
+       this.focusPickerCellByKey(this.getPriorityYearCell(cells).year);
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:502:9
-       if (cell == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker overlay restores the day grid and outer header to their interactive state on returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
  and 7 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:507:9
-       if (el == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker overlay restores the day grid and outer header to their interactive state on returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
  and 7 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:515:9
-       if (index === -1) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker overlay restores the day grid and outer header to their interactive state on returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
  and 7 more tests!

[Survived] UnaryOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:515:19
-       if (index === -1) {
+       if (index === +1) {
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker overlay restores the day grid and outer header to their interactive state on returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
  and 7 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:523:9
-       if (key == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:523:22
-       if (key == null) {
-         return;
-       }
+       if (key == null) {}
Tests ran:
    bds-calendar-grid quick-picker grid markup marks out-of-range month cells as aria-disabled and ignores their activation
    bds-calendar-grid quick-picker grid markup marks year cells whose whole span falls outside min/max as aria-disabled

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:528:9
-       if (el == null) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 45 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:536:9
-       if (index === -1) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 45 more tests!

[Survived] UnaryOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:536:19
-       if (index === -1) {
+       if (index === +1) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 45 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:546:7
-         preferredYear != null ? cells.find(cell => cell.year === preferredYear && !cell.isDisabled) : undefined;
+         true ? cells.find(cell => cell.year === preferredYear && !cell.isDisabled) : undefined;
Tests ran:
    bds-calendar-grid quick-picker nested header steps the year picker window by a decade from its own header
    bds-calendar-grid quick-picker paging pages the year picker window by a decade with PageUp and PageDown
    bds-calendar-grid quick-picker year-window focus keeps real focus on the equivalent year cell after a year-window shift
  and 4 more tests!

[Survived] OptionalChaining
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:548:31
-       this.focusPickerCellByKey(target?.year);
+       this.focusPickerCellByKey(target.year);
Tests ran:
    bds-calendar-grid quick-picker nested header steps the year picker window by a decade from its own header
    bds-calendar-grid quick-picker paging pages the year picker window by a decade with PageUp and PageDown
    bds-calendar-grid quick-picker year-window focus keeps real focus on the equivalent year cell after a year-window shift
  and 4 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:579:9
-       if (cell.isToday) {
+       if (true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 117 more tests!

[Survived] ObjectLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:587:64
-       const { cells } = generateMonthPickerGrid(this.pickerYear, {
-         locale: this.locale,
-         min: this.min,
-         max: this.max,
-         now: this.now,
-       });
+       const { cells } = generateMonthPickerGrid(this.pickerYear, {});
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:611:7
-         cells.find(
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
-         ) ??
-         cells.find(
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
-         ) ??
+         cells.find(cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month) && cells.find(cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ArrowFunction
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:9
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           () => undefined,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:17
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => true,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:17
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => false,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:17
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => !cell.isDisabled && this.selectedYear === this.pickerYear || this.selectedMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:17
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => true && this.selectedMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:17
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => !cell.isDisabled || this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:17
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:37
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => !cell.isDisabled && true && this.selectedMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:78
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && true,
Tests ran:
    bds-calendar-grid quick-picker selection state flags the selected date month with --selected and aria-selected, and no other month
    bds-calendar-grid quick-picker selection state flags the selected date year with aria-selected in the year picker

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:37
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => !cell.isDisabled && this.selectedYear !== this.pickerYear && this.selectedMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:612:78
-           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth === cell.month,
+           cell => !cell.isDisabled && this.selectedYear === this.pickerYear && this.selectedMonth !== cell.month,
Tests ran:
    bds-calendar-grid quick-picker selection state flags the selected date month with --selected and aria-selected, and no other month
    bds-calendar-grid quick-picker selection state flags the selected date year with aria-selected in the year picker

[Survived] ArrowFunction
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:9
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           () => undefined,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:17
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => true,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:17
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => false,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:17
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear || this.rangeEndMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:17
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => true && this.rangeEndMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:17
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => !cell.isDisabled || this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:17
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 44 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:37
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => !cell.isDisabled && true && this.rangeEndMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 42 more tests!

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:37
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => !cell.isDisabled && this.rangeEndYear !== this.pickerYear && this.rangeEndMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 42 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:78
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && true,
Tests ran:
    bds-calendar-grid quick-picker selection state flags both range boundary months independently with no spanning highlight

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:615:78
-           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month,
+           cell => !cell.isDisabled && this.rangeEndYear === this.pickerYear && this.rangeEndMonth !== cell.month,
Tests ran:
    bds-calendar-grid quick-picker selection state flags both range boundary months independently with no spanning highlight

[Survived] ArrowFunction
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:9
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           () => undefined,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 43 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:17
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => true,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 43 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:17
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => false,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 43 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:17
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear || this.rangeStartMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 43 more tests!
