[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:17
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => true && this.rangeStartMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 43 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:17
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => !cell.isDisabled || this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 43 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:17
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 43 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:37
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => !cell.isDisabled && true && this.rangeStartMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 41 more tests!

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:37
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => !cell.isDisabled && this.rangeStartYear !== this.pickerYear && this.rangeStartMonth === cell.month,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 41 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:80
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && true,
Tests ran:
    bds-calendar-grid quick-picker selection state flags both range boundary years independently in the year picker

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:618:80
-           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month,
+           cell => !cell.isDisabled && this.rangeStartYear === this.pickerYear && this.rangeStartMonth !== cell.month,
Tests ran:
    bds-calendar-grid quick-picker selection state flags both range boundary years independently in the year picker

[Survived] ArrowFunction
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:620:18
-         cells.find(cell => !cell.isDisabled && cell.isCurrentMonth) ??
+         cells.find(() => undefined) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 42 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:620:26
-         cells.find(cell => !cell.isDisabled && cell.isCurrentMonth) ??
+         cells.find(cell => true) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 42 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:620:26
-         cells.find(cell => !cell.isDisabled && cell.isCurrentMonth) ??
+         cells.find(cell => !cell.isDisabled || cell.isCurrentMonth) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 42 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:620:26
-         cells.find(cell => !cell.isDisabled && cell.isCurrentMonth) ??
+         cells.find(cell => false) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 42 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:620:26
-         cells.find(cell => !cell.isDisabled && cell.isCurrentMonth) ??
+         cells.find(cell => cell.isDisabled && cell.isCurrentMonth) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 42 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:7
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
-         cells.find(cell => !cell.isDisabled && cell.isCurrentYear) ??
+         (cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ?? cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ?? cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year)) && cells.find(cell => !cell.isDisabled && cell.isCurrentYear) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:7
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
+         (cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ?? cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year)) && cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:7
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) && cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ArrowFunction
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:18
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
+         cells.find(() => undefined) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:26
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
+         cells.find(cell => true) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:26
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
+         cells.find(cell => false) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:26
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled || this.selectedYear === cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:26
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
+         cells.find(cell => cell.isDisabled && this.selectedYear === cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:46
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled && true) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:627:46
-         cells.find(cell => !cell.isDisabled && this.selectedYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled && this.selectedYear !== cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ArrowFunction
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:628:18
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
+         cells.find(() => undefined) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 16 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:628:26
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
+         cells.find(cell => true) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 16 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:628:26
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
+         cells.find(cell => false) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 16 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:628:26
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled || this.rangeEndYear === cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 16 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:628:26
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
+         cells.find(cell => cell.isDisabled && this.rangeEndYear === cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 16 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:628:46
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled && true) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 16 more tests!

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:628:46
-         cells.find(cell => !cell.isDisabled && this.rangeEndYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled && this.rangeEndYear !== cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 16 more tests!

[Survived] ArrowFunction
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:629:18
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
+         cells.find(() => undefined) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:629:26
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
+         cells.find(cell => true) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:629:26
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
+         cells.find(cell => false) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:629:26
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled || this.rangeStartYear === cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:629:26
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
+         cells.find(cell => cell.isDisabled && this.rangeStartYear === cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:629:46
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled && true) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:629:46
-         cells.find(cell => !cell.isDisabled && this.rangeStartYear === cell.year) ??
+         cells.find(cell => !cell.isDisabled && this.rangeStartYear !== cell.year) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] ArrowFunction
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:630:18
-         cells.find(cell => !cell.isDisabled && cell.isCurrentYear) ??
+         cells.find(() => undefined) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:630:26
-         cells.find(cell => !cell.isDisabled && cell.isCurrentYear) ??
+         cells.find(cell => true) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:630:26
-         cells.find(cell => !cell.isDisabled && cell.isCurrentYear) ??
+         cells.find(cell => false) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] LogicalOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:630:26
-         cells.find(cell => !cell.isDisabled && cell.isCurrentYear) ??
+         cells.find(cell => !cell.isDisabled || cell.isCurrentYear) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:630:26
-         cells.find(cell => !cell.isDisabled && cell.isCurrentYear) ??
+         cells.find(cell => cell.isDisabled && cell.isCurrentYear) ??
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 15 more tests!
