[Survived] ObjectLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:636:68
-       const { cells } = generateYearPickerGrid(this.pickerStartYear, { min: this.min, max: this.max, now: this.now });
+       const { cells } = generateYearPickerGrid(this.pickerStartYear, {});
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:645:31
-       const matchesRangeStart = this.rangeStartYear === this.pickerYear && this.rangeStartMonth === cell.month;
+       const matchesRangeStart = true && this.rangeStartMonth === cell.month;
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:646:29
-       const matchesRangeEnd = this.rangeEndYear === this.pickerYear && this.rangeEndMonth === cell.month;
+       const matchesRangeEnd = true && this.rangeEndMonth === cell.month;
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:664:39
-         cellEl.setAttribute('tabindex', '-1');
+         cellEl.setAttribute('tabindex', "");
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 56 more tests!

[Survived] OptionalChaining
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:671:5
-       this._cellRefs.get(cell.isoDate)?.setAttribute('tabindex', '0');
+       this._cellRefs.get(cell.isoDate).setAttribute('tabindex', '0');
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 55 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:678:8
-         [`${PREFIX}__picker-cell--current`]: cell.isCurrentMonth,
+         [``]: cell.isCurrentMonth,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:680:8
-         [`${PREFIX}__picker-cell--disabled`]: cell.isDisabled,
+         [``]: cell.isDisabled,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:689:12
-       return this.rangeEnd != null ? Number(this.rangeEnd.slice(5, 7)) - 1 : undefined;
+       return true ? Number(this.rangeEnd.slice(5, 7)) - 1 : undefined;
Tests ran:
    bds-calendar-grid quick-picker selection state flags both range boundary months independently with no spanning highlight

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:697:12
-       return this.rangeStart != null ? Number(this.rangeStart.slice(5, 7)) - 1 : undefined;
+       return true ? Number(this.rangeStart.slice(5, 7)) - 1 : undefined;
Tests ran:
    bds-calendar-grid quick-picker selection state flags both range boundary months independently with no spanning highlight
    bds-calendar-grid quick-picker selection state flags both range boundary years independently in the year picker

[Survived] EqualityOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:706:12
-       return target.year * 12 + target.month >= current ? 'next' : 'prev';
+       return target.year * 12 + target.month > current ? 'next' : 'prev';
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Enter, emitting bdsMonthNavigate and returning to the day view
    bds-calendar-grid quick-picker keyboard and aria selects the focused month cell with Space, emitting bdsMonthNavigate
  and 1 more test!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:715:12
-       return this.selectedDate != null ? Number(this.selectedDate.slice(5, 7)) - 1 : undefined;
+       return true ? Number(this.selectedDate.slice(5, 7)) - 1 : undefined;
Tests ran:
    bds-calendar-grid quick-picker selection state flags the selected date month with --selected and aria-selected, and no other month
    bds-calendar-grid quick-picker selection state flags the selected date year with aria-selected in the year picker

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:725:12
-       } else {
-         this._cellRefs.delete(isoDate);
-       }
+       } else {}
Tests ran:
    bds-calendar-grid keyboard moves the roving-tabindex stop to the selected date when the displayed month changes
    bds-calendar-grid keyboard prefers the selected date over today when both fall in the displayed month
    bds-calendar-grid keyboard re-establishes a single roving-tabindex stop after the displayed month changes
  and 1 more test!

[Survived] CallExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:726:7
-         this._cellRefs.delete(isoDate);
+         ;
Tests ran:
    bds-calendar-grid keyboard moves the roving-tabindex stop to the selected date when the displayed month changes
    bds-calendar-grid keyboard prefers the selected date over today when both fall in the displayed month
    bds-calendar-grid keyboard re-establishes a single roving-tabindex stop after the displayed month changes
  and 1 more test!

[Survived] ConditionalExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:731:9
-       if (el != null) {
+       if (true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] BlockStatement
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:733:12
-       } else {
-         this._pickerCellRefs.delete(key);
-       }
+       } else {}
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
  and 25 more tests!

[Survived] CallExpression
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:734:7
-         this._pickerCellRefs.delete(key);
+         ;
Tests ran:
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
  and 25 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:740:8
-         [`${PREFIX}__picker-cell`]: true,
+         [``]: true,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] BooleanLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:740:35
-         [`${PREFIX}__picker-cell`]: true,
+         [`${PREFIX}__picker-cell`]: false,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:742:8
-         [`${PREFIX}__picker-cell--current`]: cell.isCurrentYear,
+         [``]: cell.isCurrentYear,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:744:8
-         [`${PREFIX}__picker-cell--disabled`]: cell.isDisabled,
+         [``]: cell.isDisabled,
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] UnaryOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:812:19
-           tabIndex={-1}
+           tabIndex={+1}
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:838:35
-                 <tr role="row" key={`month-row-${rowIndex}`}>
+                 <tr role="row" key={``}>
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 46 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:898:31
-             <tr role="row" key={`week-${weekIndex}`}>
+             <tr role="row" key={``}>
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 124 more tests!

[Survived] UnaryOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:912:19
-           tabIndex={-1}
+           tabIndex={+1}
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:928:19
-         <div class={`${PREFIX}__picker-card`}>
+         <div class={``}>
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:933:35
-                 <tr role="row" key={`year-row-${rowIndex}`}>
+                 <tr role="row" key={``}>
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ArithmeticOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:950:52
-             disabled={this.isYearWindowFullyDisabled(startYear - 10)}
+             disabled={this.isYearWindowFullyDisabled(startYear + 10)}
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] ArithmeticOperator
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:960:52
-             disabled={this.isYearWindowFullyDisabled(startYear + 10)}
+             disabled={this.isYearWindowFullyDisabled(startYear - 10)}
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
    bds-calendar-grid quick-picker view state machine returns to the month picker for the chosen year when a year is activated, not the day grid
    bds-calendar-grid quick-picker grid markup renders the year picker as a role="grid" table of row/gridcell cells
  and 17 more tests!

[Survived] StringLiteral
src/components/forms/bds-date-picker/bds-calendar-grid/bds-calendar-grid.tsx:976:21
-           <div class={`${PREFIX}__grid-area`}>
+           <div class={``}>
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 124 more tests!

[NoCoverage] ArrayDeclaration
src/utils/a11y/keyboard/navigation/grid-navigation.ts:45:61
-         .filter((pos): pos is GridPosition => pos != null) ?? []
+         .filter((pos): pos is GridPosition => pos != null) ?? ["Stryker was here"]

[NoCoverage] UnaryOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:68:25
-         if (!wrap) return -1;
+         if (!wrap) return +1;

[NoCoverage] UnaryOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:76:10
-     return -1;
+     return +1;

[NoCoverage] StringLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:96:36
-         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toLowerCase() ?? 'bds-grid'}-item`)
+         ? (focusStrategy.idPrefix ?? ``)

[NoCoverage] LogicalOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:96:39
-         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toLowerCase() ?? 'bds-grid'}-item`)
+         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toLowerCase() && 'bds-grid'}-item`)

[NoCoverage] MethodExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:96:39
-         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toLowerCase() ?? 'bds-grid'}-item`)
+         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toUpperCase() ?? 'bds-grid'}-item`)

[NoCoverage] OptionalChaining
src/utils/a11y/keyboard/navigation/grid-navigation.ts:96:39
-         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toLowerCase() ?? 'bds-grid'}-item`)
+         ? (focusStrategy.idPrefix ?? `${ctrl.root.tagName.toLowerCase() ?? 'bds-grid'}-item`)

[NoCoverage] StringLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:96:75
-         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toLowerCase() ?? 'bds-grid'}-item`)
+         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toLowerCase() ?? ""}-item`)

[NoCoverage] BlockStatement
src/utils/a11y/keyboard/navigation/grid-navigation.ts:113:65
-       if (strategyType === FOCUS_STRATEGY.ARIA_ACTIVE_DESCENDANT) {
-         if (ctrl.root != null) applyGridAriaActiveDescendant(items, row, col, ctrl.root, idPrefix);
-       } else {
+       if (strategyType === FOCUS_STRATEGY.ARIA_ACTIVE_DESCENDANT) {} else {

[NoCoverage] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:114:11
-         if (ctrl.root != null) applyGridAriaActiveDescendant(items, row, col, ctrl.root, idPrefix);
+         if (true) applyGridAriaActiveDescendant(items, row, col, ctrl.root, idPrefix);

[NoCoverage] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:114:11
-         if (ctrl.root != null) applyGridAriaActiveDescendant(items, row, col, ctrl.root, idPrefix);
+         if (false) applyGridAriaActiveDescendant(items, row, col, ctrl.root, idPrefix);

[NoCoverage] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:114:11
-         if (ctrl.root != null) applyGridAriaActiveDescendant(items, row, col, ctrl.root, idPrefix);
+         if (ctrl.root == null) applyGridAriaActiveDescendant(items, row, col, ctrl.root, idPrefix);

[NoCoverage] CallExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:114:30
-         if (ctrl.root != null) applyGridAriaActiveDescendant(items, row, col, ctrl.root, idPrefix);
+         if (ctrl.root != null) ;

[NoCoverage] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:162:22
-       const edgeCell = dCol > 0 ? rowPositions[rowPositions.length - 1] : rowPositions[0];
+       const edgeCell = true ? rowPositions[rowPositions.length - 1] : rowPositions[0];

[NoCoverage] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:162:22
-       const edgeCell = dCol > 0 ? rowPositions[rowPositions.length - 1] : rowPositions[0];
+       const edgeCell = false ? rowPositions[rowPositions.length - 1] : rowPositions[0];

[NoCoverage] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:162:22
-       const edgeCell = dCol > 0 ? rowPositions[rowPositions.length - 1] : rowPositions[0];
+       const edgeCell = dCol >= 0 ? rowPositions[rowPositions.length - 1] : rowPositions[0];

[NoCoverage] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:162:22
-       const edgeCell = dCol > 0 ? rowPositions[rowPositions.length - 1] : rowPositions[0];
+       const edgeCell = dCol <= 0 ? rowPositions[rowPositions.length - 1] : rowPositions[0];

[NoCoverage] ArithmeticOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:162:46
-       const edgeCell = dCol > 0 ? rowPositions[rowPositions.length - 1] : rowPositions[0];
+       const edgeCell = dCol > 0 ? rowPositions[rowPositions.length + 1] : rowPositions[0];

[NoCoverage] CallExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:163:5
-       applyFocus(items, edgeCell.row, edgeCell.col);
+       ;

[NoCoverage] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:200:21
-       if (e.repeat && repeatThrottleMs > 0) {
+       if (e.repeat && true) {

[NoCoverage] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:200:21
-       if (e.repeat && repeatThrottleMs > 0) {
+       if (e.repeat && repeatThrottleMs >= 0) {

[NoCoverage] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:200:21
-       if (e.repeat && repeatThrottleMs > 0) {
+       if (e.repeat && repeatThrottleMs <= 0) {

[NoCoverage] BlockStatement
src/utils/a11y/keyboard/navigation/grid-navigation.ts:200:43
-       if (e.repeat && repeatThrottleMs > 0) {
-         const now = Date.now();
-         if (now - lastRepeatTime < repeatThrottleMs) return;
-         lastRepeatTime = now;
-       }
+       if (e.repeat && repeatThrottleMs > 0) {}

[NoCoverage] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:202:11
-         if (now - lastRepeatTime < repeatThrottleMs) return;
+         if (true) return;

[NoCoverage] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:202:11
-         if (now - lastRepeatTime < repeatThrottleMs) return;
+         if (false) return;

[NoCoverage] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:202:11
-         if (now - lastRepeatTime < repeatThrottleMs) return;
+         if (now - lastRepeatTime <= repeatThrottleMs) return;

[NoCoverage] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:202:11
-         if (now - lastRepeatTime < repeatThrottleMs) return;
+         if (now - lastRepeatTime >= repeatThrottleMs) return;

[NoCoverage] ArithmeticOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:202:11
-         if (now - lastRepeatTime < repeatThrottleMs) return;
+         if (now + lastRepeatTime < repeatThrottleMs) return;

[NoCoverage] BlockStatement
src/utils/a11y/keyboard/navigation/grid-navigation.ts:265:30
-             (e: MouseEvent) => {
-               e.preventDefault();
-               root.focus();
-             },
+             (e: MouseEvent) => {},

[NoCoverage] CallExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:266:13
-               e.preventDefault();
+               ;

[NoCoverage] CallExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:267:13
-               root.focus();
+               ;

[Survived] OptionalChaining
src/utils/a11y/keyboard/navigation/grid-navigation.ts:43:5
-       items[row]
-         ?.map((cell, col) => (isHTMLElement(cell) ? { row, col, cell } : null))
+       items[row].map((cell, col) => (isHTMLElement(cell) ? { row, col, cell } : null))
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
  and 14 more tests!

[Survived] LogicalOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:50:7
-     if (row < 0 || col < 0) return null;
+     if (row < 0 && col < 0) return null;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 11 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:50:7
-     if (row < 0 || col < 0) return null;
+     if (false || col < 0) return null;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 11 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:50:18
-     if (row < 0 || col < 0) return null;
+     if (row < 0 || false) return null;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 9 more tests!

[Survived] OptionalChaining
src/utils/a11y/keyboard/navigation/grid-navigation.ts:51:16
-     const cell = items.at(row)?.at(col);
+     const cell = items.at(row).at(col);
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 9 more tests!

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:58:12
-       return Math.abs(position.col - col) < Math.abs(closest.col - col) ? position : closest;
+       return Math.abs(position.col - col) <= Math.abs(closest.col - col) ? position : closest;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 2 more tests!
