[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:66:25
-     for (let checked = 0; checked < rowCount; checked++) {
+     for (let checked = 0; checked <= rowCount; checked++) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 7 more tests!

[Survived] UpdateOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:66:45
-     for (let checked = 0; checked < rowCount; checked++) {
+     for (let checked = 0; checked < rowCount; checked--) {
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus vertically from the last row to the first row and back

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:67:9
-       if (row < 0 || row >= rowCount) {
+       if (row <= 0 || row >= rowCount) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 7 more tests!

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:67:20
-       if (row < 0 || row >= rowCount) {
+       if (row < 0 || row > rowCount) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 6 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:68:11
-         if (!wrap) return -1;
+         if (false) return -1;
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus vertically from the last row to the first row and back

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:69:13
-         row = row < 0 ? rowCount - 1 : 0;
+         row = row <= 0 ? rowCount - 1 : 0;
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus vertically from the last row to the first row and back

[Survived] BooleanLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:81:12
-       wrap = false,
+       wrap = true,
Tests ran:
    setupGridNavigation registers grid keys and resolves strategy metadata
    setupGridNavigation initializes from the first valid grid cell when earlier cells are empty
    setupGridNavigation moves through irregular rows and skips empty cells
  and 9 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:95:5
-       focusStrategy.type === FOCUS_STRATEGY.ARIA_ACTIVE_DESCENDANT
+       false
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] LogicalOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:96:10
-         ? (focusStrategy.idPrefix ?? `${ctrl.root?.tagName.toLowerCase() ?? 'bds-grid'}-item`)
+         ? (focusStrategy.idPrefix && `${ctrl.root?.tagName.toLowerCase() ?? 'bds-grid'}-item`)
Tests ran:
    setupGridNavigation applies aria-activedescendant to the selected initial grid cell

[Survived] OptionalChaining
src/utils/a11y/keyboard/navigation/grid-navigation.ts:105:18
-       const cell = items[row]?.[col];
+       const cell = items[row][col];
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
  and 14 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:106:9
-       if (cell == null) return;
+       if (false) return;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
  and 14 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:113:9
-       if (strategyType === FOCUS_STRATEGY.ARIA_ACTIVE_DESCENDANT) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
  and 13 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:123:9
-       if (positions.length === 0) return;
+       if (false) return;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 12 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:135:11
-         if (nextRow === -1) return;
+         if (false) return;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 3 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:138:11
-         if (nextCell != null) applyFocus(items, nextCell.row, nextCell.col);
+         if (true) applyFocus(items, nextCell.row, nextCell.col);
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 3 more tests!

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:146:9
-       if (nextRowIndex >= 0 && nextRowIndex < rowPositions.length) {
+       if (nextRowIndex > 0 && nextRowIndex < rowPositions.length) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 9 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:152:9
-       if (wrap && items.length > 1) {
+       if (true) {
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus from the end of a row to the start of the next row
  and 1 more test!

[Survived] LogicalOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:152:9
-       if (wrap && items.length > 1) {
+       if (wrap || items.length > 1) {
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus from the end of a row to the start of the next row
  and 1 more test!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:152:17
-       if (wrap && items.length > 1) {
+       if (wrap && true) {
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus from the end of a row to the start of the next row
  and 1 more test!

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:152:17
-       if (wrap && items.length > 1) {
+       if (wrap && items.length >= 1) {
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus from the end of a row to the start of the next row
  and 1 more test!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:153:59
-         const nextRow = findRowWithCells(items, row + dCol, dCol > 0 ? 1 : -1, true);
+         const nextRow = findRowWithCells(items, row + dCol, false ? 1 : -1, true);
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus from the end of a row to the start of the next row
  and 1 more test!

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:153:59
-         const nextRow = findRowWithCells(items, row + dCol, dCol > 0 ? 1 : -1, true);
+         const nextRow = findRowWithCells(items, row + dCol, dCol >= 0 ? 1 : -1, true);
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus from the end of a row to the start of the next row
  and 1 more test!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:154:11
-         if (nextRow === -1) return;
+         if (false) return;
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus from the end of a row to the start of the next row
  and 1 more test!

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:157:24
-         const nextCell = dCol > 0 ? nextRowPositions[0] : nextRowPositions[nextRowPositions.length - 1];
+         const nextCell = dCol >= 0 ? nextRowPositions[0] : nextRowPositions[nextRowPositions.length - 1];
Tests ran:
    bds-calendar-grid keyboard skips disabled cells so they are never a focus stop
    bds-calendar-grid keyboard skips out-of-month filler cells so they are never a focus stop
    bds-calendar-grid keyboard wraps focus from the end of a row to the start of the next row
  and 1 more test!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:169:9
-       if (positions.length === 0) return;
+       if (false) return;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves focus to the current row start and end with Home and End
    bds-calendar-grid keyboard moves focus to the grid start and end with Ctrl+Home and Ctrl+End
  and 1 more test!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:173:9
-       if (row === -1 || getRowPositions(items, row).length === 0) row = positions[0].row;
+       if (false) row = positions[0].row;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves focus to the current row start and end with Home and End
    bds-calendar-grid keyboard moves focus to the grid start and end with Ctrl+Home and Ctrl+End

[Survived] LogicalOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:173:9
-       if (row === -1 || getRowPositions(items, row).length === 0) row = positions[0].row;
+       if (row === -1 && getRowPositions(items, row).length === 0) row = positions[0].row;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves focus to the current row start and end with Home and End
    bds-calendar-grid keyboard moves focus to the grid start and end with Ctrl+Home and Ctrl+End

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:173:9
-       if (row === -1 || getRowPositions(items, row).length === 0) row = positions[0].row;
+       if (false || getRowPositions(items, row).length === 0) row = positions[0].row;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves focus to the current row start and end with Home and End
    bds-calendar-grid keyboard moves focus to the grid start and end with Ctrl+Home and Ctrl+End

[Survived] UnaryOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:173:17
-       if (row === -1 || getRowPositions(items, row).length === 0) row = positions[0].row;
+       if (row === +1 || getRowPositions(items, row).length === 0) row = positions[0].row;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves focus to the current row start and end with Home and End
    bds-calendar-grid keyboard moves focus to the grid start and end with Ctrl+Home and Ctrl+End

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:173:23
-       if (row === -1 || getRowPositions(items, row).length === 0) row = positions[0].row;
+       if (row === -1 || false) row = positions[0].row;
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria moves within the current year row and to the window edges with Home/End
    bds-calendar-grid keyboard moves focus to the current row start and end with Home and End
    bds-calendar-grid keyboard moves focus to the grid start and end with Ctrl+Home and Ctrl+End

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:200:9
-       if (e.repeat && repeatThrottleMs > 0) {
+       if (false) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria traverses month cells with the arrow keys keeping exactly one roving-tabindex stop
    bds-calendar-grid keyboard moves DOM focus cell-to-cell with the arrow keys across the visible month
    bds-calendar-grid keyboard keeps exactly one roving-tabindex stop on the focused cell after arrow traversal
  and 12 more tests!

[Survived] ObjectLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:211:5
-       { repeat: true },
+       {},
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] BooleanLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:211:15
-       { repeat: true },
+       { repeat: false },
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ObjectLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:216:5
-       { repeat: true },
+       {},
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] BooleanLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:216:15
-       { repeat: true },
+       { repeat: false },
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] BooleanLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:221:15
-       { repeat: true },
+       { repeat: false },
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ObjectLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:221:5
-       { repeat: true },
+       {},
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ObjectLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:226:5
-       { repeat: true },
+       {},
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] BooleanLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:226:15
-       { repeat: true },
+       { repeat: false },
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:233:7
-     if (onActivate != null && activateKeys.length > 0) {
+     if (true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] LogicalOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:233:7
-     if (onActivate != null && activateKeys.length > 0) {
+     if (onActivate != null || activateKeys.length > 0) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:233:7
-     if (onActivate != null && activateKeys.length > 0) {
+     if (true && activateKeys.length > 0) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:233:29
-     if (onActivate != null && activateKeys.length > 0) {
+     if (onActivate != null && true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 127 more tests!

[Survived] EqualityOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:233:29
-     if (onActivate != null && activateKeys.length > 0) {
+     if (onActivate != null && activateKeys.length >= 0) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 127 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:236:13
-           if (document.activeElement instanceof HTMLElement) {
+           if (true) {
Tests ran:
    bds-calendar-grid quick-picker keyboard and aria opens the month picker exactly once from Enter on the focused header label
    bds-calendar-grid quick-picker keyboard and aria opens the month picker exactly once from Space on the focused header label
    bds-calendar-grid quick-picker keyboard activation edges ignores keyboard activation of a disabled year cell
  and 1 more test!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:244:7
-     if (onPageUp != null) ctrl.register(KEYBOARD.PageUp, onPageUp);
+     if (true) ctrl.register(KEYBOARD.PageUp, onPageUp);
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:245:7
-     if (onPageDown != null) ctrl.register(KEYBOARD.PageDown, onPageDown);
+     if (true) ctrl.register(KEYBOARD.PageDown, onPageDown);
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:246:7
-     if (onEscape != null) ctrl.register(KEYBOARD.Escape, onEscape);
+     if (true) ctrl.register(KEYBOARD.Escape, onEscape);
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:248:7
-     if (ctrl.root != null && ctrl.abortController != null) {
+     if (true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] LogicalOperator
src/utils/a11y/keyboard/navigation/grid-navigation.ts:248:7
-     if (ctrl.root != null && ctrl.abortController != null) {
+     if (ctrl.root != null || ctrl.abortController != null) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:248:7
-     if (ctrl.root != null && ctrl.abortController != null) {
+     if (true && ctrl.abortController != null) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 136 more tests!

[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:254:9
-           initialActiveSelector != null
+           true
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 135 more tests!
