[Survived] CallExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:263:9
-           root.addEventListener(
-             'mousedown',
-             (e: MouseEvent) => {
-               e.preventDefault();
-               root.focus();
-             },
-             { signal },
-           );
+           ;
Tests ran:
    setupGridNavigation applies aria-activedescendant to the selected initial grid cell

[Survived] StringLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:264:11
-             'mousedown',
+             "",
Tests ran:
    setupGridNavigation applies aria-activedescendant to the selected initial grid cell

[Survived] ObjectLiteral
src/utils/a11y/keyboard/navigation/grid-navigation.ts:269:11
-             { signal },
+             {},
Tests ran:
    setupGridNavigation applies aria-activedescendant to the selected initial grid cell
