[Survived] ConditionalExpression
src/utils/a11y/keyboard/navigation/grid-navigation.ts:248:28
-     if (ctrl.root != null && ctrl.abortController != null) {
+     if (ctrl.root != null && true) {
Tests ran:
    bds-calendar-grid quick-picker view state machine opens the month picker when the header month/year label is activated
    bds-calendar-grid quick-picker view state machine returns to the day view and emits bdsMonthNavigate with the picked absolute month when a month is activated
    bds-calendar-grid quick-picker view state machine opens the year picker from the month view year control without leaving the overlay
  and 145 more tests!
