[NoCoverage] BlockStatement
src/services/date-engine/date-math.ts:21:59
-   export function addDays(date: Date, amount: number): Date {
-     return addDaysFns(date, amount);
-   }
+   export function addDays(date: Date, amount: number): Date {}

[NoCoverage] BlockStatement
src/services/date-engine/date-math.ts:29:59
-   export function subDays(date: Date, amount: number): Date {
-     return subDaysFns(date, amount);
-   }
+   export function subDays(date: Date, amount: number): Date {}

[NoCoverage] BlockStatement
src/services/date-engine/date-math.ts:33:48
-   export function startOfMonth(date: Date): Date {
-     return startOfMonthFns(date);
-   }
+   export function startOfMonth(date: Date): Date {}

[NoCoverage] BlockStatement
src/services/date-engine/date-math.ts:37:46
-   export function endOfMonth(date: Date): Date {
-     return endOfMonthFns(date);
-   }
+   export function endOfMonth(date: Date): Date {}

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:62:7
-     if (weekStartsOn !== undefined) {
+     if (true) {
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 41 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:78:7
-     if (max !== undefined) {
+     if (true) {
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 31 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:94:7
-     if (min !== undefined && compareDates(cellEnd, min) < 0) {
+     if (true && compareDates(cellEnd, min) < 0) {
Tests ran:
    generateMonthPickerGrid returns exactly 12 cells with month 0..11 in order and echoes the year
    generateMonthPickerGrid produces the English short month labels by default
    generateMonthPickerGrid produces a non-English locale's short month labels
  and 23 more tests!

[Survived] EqualityOperator
src/services/date-engine/grid.ts:94:28
-     if (min !== undefined && compareDates(cellEnd, min) < 0) {
+     if (min !== undefined && compareDates(cellEnd, min) <= 0) {
Tests ran:
    generateMonthPickerGrid disables only months whose entire span falls before min
    generateMonthPickerGrid keeps a month enabled when min/max only partially overlaps its span
    generateMonthPickerGrid enables a month whose very last day equals min and disables the one before it
  and 3 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:98:10
-     return max !== undefined && compareDates(cellStart, max) > 0;
+     return true && compareDates(cellStart, max) > 0;
Tests ran:
    generateMonthPickerGrid returns exactly 12 cells with month 0..11 in order and echoes the year
    generateMonthPickerGrid produces the English short month labels by default
    generateMonthPickerGrid produces a non-English locale's short month labels
  and 23 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:106:24
-     const isRangeStart = rangeStart !== undefined && isSameDay(date, rangeStart);
+     const isRangeStart = true && isSameDay(date, rangeStart);
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:107:22
-     const isRangeEnd = rangeEnd !== undefined && isSameDay(date, rangeEnd);
+     const isRangeEnd = true && isSameDay(date, rangeEnd);
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:109:5
-       rangeStart !== undefined &&
-       rangeEnd !== undefined &&
+       true &&
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] LogicalOperator
src/services/date-engine/grid.ts:109:5
-       rangeStart !== undefined &&
-       rangeEnd !== undefined &&
+       rangeStart !== undefined || rangeEnd !== undefined &&
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:109:5
-       rangeStart !== undefined &&
+       true &&
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:110:5
-       rangeEnd !== undefined &&
+       true &&
Tests ran:
    generateMonthGrid never flags an adjacent-month filler cell as in-range/range-start/range-end, even when its real date falls within the supplied range bounds
    generateMonthGrid leaves every cell with preview flags false when previewEnd is not supplied
    generateMonthGrid flags the preview start/interior/end cells when both rangeStart and previewEnd are supplied
  and 3 more tests!

[Survived] EqualityOperator
src/services/date-engine/grid.ts:112:5
-       compareDates(date, rangeEnd) < 0;
+       compareDates(date, rangeEnd) <= 0;
Tests ran:
    generateMonthGrid never flags an adjacent-month filler cell as in-range/range-start/range-end, even when its real date falls within the supplied range bounds
    generateMonthGrid flags the preview start/interior/end cells when both rangeStart and previewEnd are supplied
    generateMonthGrid does not flag a preview end cell as a committed range flag, keeping preview and committed state independent
  and 2 more tests!

[Survived] ObjectLiteral
src/services/date-engine/grid.ts:132:12
-       return { isPreviewInRange: false, isPreviewStart: false, isPreviewEnd: false };
+       return {};
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 33 more tests!

[Survived] EqualityOperator
src/services/date-engine/grid.ts:135:31
-     const previewEndIsEarlier = compareDates(previewEnd, rangeStart) < 0;
+     const previewEndIsEarlier = compareDates(previewEnd, rangeStart) <= 0;
Tests ran:
    generateMonthGrid flags the preview start/interior/end cells when both rangeStart and previewEnd are supplied
    generateMonthGrid does not flag a preview end cell as a committed range flag, keeping preview and committed state independent
    generateMonthGrid flags the chronologically-earlier previewEnd as the preview start and rangeStart as the preview end when previewEnd falls before rangeStart
  and 1 more test!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:167:24
-       hasRangeCompanion: rangeEnd !== undefined || previewEnd !== undefined,
+       hasRangeCompanion: true,
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:167:24
-       hasRangeCompanion: rangeEnd !== undefined || previewEnd !== undefined,
+       hasRangeCompanion: false,
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] LogicalOperator
src/services/date-engine/grid.ts:167:24
-       hasRangeCompanion: rangeEnd !== undefined || previewEnd !== undefined,
+       hasRangeCompanion: rangeEnd !== undefined && previewEnd !== undefined,
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:167:24
-       hasRangeCompanion: rangeEnd !== undefined || previewEnd !== undefined,
+       hasRangeCompanion: false || previewEnd !== undefined,
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] EqualityOperator
src/services/date-engine/grid.ts:167:24
-       hasRangeCompanion: rangeEnd !== undefined || previewEnd !== undefined,
+       hasRangeCompanion: rangeEnd === undefined || previewEnd !== undefined,
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!

[Survived] ConditionalExpression
src/services/date-engine/grid.ts:167:50
-       hasRangeCompanion: rangeEnd !== undefined || previewEnd !== undefined,
+       hasRangeCompanion: rangeEnd !== undefined || false,
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 35 more tests!

[Survived] EqualityOperator
src/services/date-engine/grid.ts:167:50
-       hasRangeCompanion: rangeEnd !== undefined || previewEnd !== undefined,
+       hasRangeCompanion: rangeEnd !== undefined || previewEnd === undefined,
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 35 more tests!

[Survived] EqualityOperator
src/services/date-engine/grid.ts:207:23
-     for (let index = 0; index < GRID_CELL_COUNT; index += 1) {
+     for (let index = 0; index <= GRID_CELL_COUNT; index += 1) {
Tests ran:
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 0
    generateMonthGrid produces a fixed 6x7 matrix for year 2026 month 1
    generateMonthGrid produces a fixed 6x7 matrix for year 2024 month 1
  and 37 more tests!
